#!../bin/cairogsh --。
加载lib/defi。
加载lib/file4。
赋予目录以调用‘得目录名’、‘参数0’。

加载lib/gjk4。
赋予1以1。
循环先
	如果‘1’大于2那么跳出。
	赋予名以‘目录’/先如果‘1’等于1那么6否则‘1’了.gif。
	赋予‘1’图【主】以使‘名’、动画源。
	赋予‘1’宽【主】以使‘‘1’图’、动画源、宽。
	赋予‘1’高【主】以使‘‘1’图’、动画源、高。
	赋予1以算术‘1’+1。
了。

使主窗、侦听、
	创建为下代码
		赋予比以0.5。
		赋予宽以算术‘比’*先如果‘1宽’大于‘1高’那么‘1宽’否则‘1高’了。
		显示‘宽’换行。
		使主窗、大小、‘宽’、‘宽’。
		使主窗、移动、500、300。
		赋予1图号以使主窗、gif、‘1图’、‘比’、‘比’。
		
		使2窗、创建、弹出窗、自绘。
		使2窗、大小、‘2宽’、‘2宽’。
		使2窗、移动、800、0。
		使2窗、gif、‘2图’。

		使起点、gif、‘1图号’、0、0。
		加载lib/transform4。
		赋予旋以算术先调用‘计算夹角’、500、300、800、0了+90。
		显示‘旋’换行。
		使旋转、gif、‘1图号’、‘旋’。
	上代码、
	显现为下代码
		赋予1以1。
		循环先
			赋予1以算术‘1’+1。
			如果不存在‘1’图【主】那么跳出。
			使‘1’窗、显现。
		了。
	上代码。
使主窗、创建、弹出窗（、自绘）。
