#!../new_o/l --。
加载lib/defi。
加载lib/transform4。
加载lib/gjk4。

定义测以下代码
	别名x1以参数1。
	别名y1以参数2。
	别名x2以参数3。
	别名y2以参数4。
	赋予数以0。
	循环先
		如果‘数’大于10那么跳出。
		调用‘计算移动’、‘x1’、‘y1’、‘x2’、‘y2’、10、‘数’、下代码
			显示‘数’制表符“‘x1’、‘y1’、‘x2’、‘y2’”制表符‘参数’换行。
		上代码。
		赋予数以算术‘数’+1。
	了。
上代码。
测0、0、100、100。
测0、0、0、100。
测0、0、100、0。
测100、100、0、0。
测0、0、2、7。
测100、100、200、300。
测100、100、100、300。

定义“测”以下代码
	别名x1以参数1。
	别名y1以参数2。
	别名x2以参数3。
	别名y2以参数4。
	显示“‘x1’、‘y1’、‘x2’、‘y2’”制表符先调用‘计算夹角’、‘x1’、‘y1’、‘x2’、‘y2’了换行。
上代码。
测0、0、100、0。
测0、100、100、0。
测0、100、0、0。
测100、100、0、0。
测100、0、0、0。
测100、0、0、100。
测0、0、0、100。
测0、0、100、100。

