#!/opt2/debug/zhscript2-rust/l --。
加载lib/imagemagick4。

定义处理以下代码
	如果‘错’那么先
		显示“错: ‘错’”换行。
		结束。
	了。
	执行“xdg-open ‘出’”。
上代码。

定义显调-以下代码
	赋予果以显调‘参数栈’。
	如果不‘果’那么结束1。
上代码。
定义显调以下代码
	显示‘参数’换行。
	解释下代码
		显示‘参数’换行。
		‘参数栈’
	上代码、调用‘‘参数1’’、‘参数栈【2】’。
上代码。

赋予49.jpg以/_pic/美女/真人/1/49.jpg。
赋予49.png以/_pic/美女/真人/1/49.png。
赋予1.jpg以/_pic/美女/真人/1/11083468129894b22bo.jpg。
赋予2.jpg以/_pic/美女/真人/1/11083469664cd22c03o.jpg。
赋予3.jpg以/_pic/美女/真人/1/1108346954981a1a6fo.jpg。
赋予4.jpg以/_pic/美女/真人/1/11083467986bedc0f6o.jpg。
赋予gzhl1.png以/_pic/美女/真人/关之琳/关之琳1.png。
赋予gzhl1.jpg以/_pic/美女/真人/关之琳/1.jpg。

	如果那么先
赋予出以/tmp/bz3.jpg。
赋予错以调用‘图扩展二’、
	‘1.jpg’、‘出’、#fff0、+、+、+、+、1920、1080、/。
处理了。
	如果那么先
赋予出以/tmp/bz3b.jpg。
赋予错以调用‘图扩展二’、
	‘1.jpg’、‘出’、#fff0、red、green、blue、yellow、1920、1080、/。
处理了。
	如果那么先
赋予出以/tmp/bz3a.jpg。
赋予错以调用‘图扩展三’、
	‘2.jpg’、‘出’、#fff0、+、+、+、+、1920、1080、500、500、/。
处理了。
	如果那么先
赋予出以/tmp/bz3a2.jpg。
赋予错以调用‘图扩展三’、
	‘2.jpg’、‘出’、#fff0、j、j、j、j、1920、1080、500、500、。
处理了。
	如果那么先
赋予出以/tmp/bz3a3.jpg。
赋予错以调用‘图扩展三’、
	‘2.jpg’、‘出’、#fff0、j、j、j、j、1920、1080、500、500、/。
处理了。
	如果那么先
赋予出以/tmp/bz3a4.jpg。
赋予错以调用‘图扩展三’、
	‘2.jpg’、‘出’、#fff0、j、j、j、j、1920、1080、0、360、/34。
处理了。
	如果那么先
赋予出以/tmp/bz3a5.jpg。
赋予错以调用‘图扩展三’、
	‘49.jpg’、‘出’、#fff0、j、j、j、j、1920、1080、0、540、/34。
处理了。
	如果那么先
赋予出以/tmp/bz3a6.jpg。
赋予错以调用‘图扩展三’、
	‘49.jpg’、‘出’、#fff0、j、j、j、j、1920、1080、640、0、-9。
处理了。
	如果那么先
赋予出以/tmp/bz3c.jpg。
赋予错以调用‘图扩展三’、
	‘49.jpg’、‘出’、#fff0、j、j、j、j、-101、-301、0、0、6。
处理了。
	如果那么先
赋予出以/tmp/bz3c2.jpg。
赋予错以调用‘图扩展三’、
	‘49.jpg’、‘出’、#fff0、j、j、j、j、-101、-201、0、0、6。
处理了。

赋予代码以下代码
	别名“x”、“y”、“宽”、“图”、“图2”以“参数1”、“参数2”、“参数3”、“参数4”、“参数5”。
	显示回车“‘宽’ ‘y’ ‘x’ ”、。
	赋予“色”以调用‘得像素’、‘图’、‘x’、‘y’。
		如果‘x’等于‘y’那么赋予“色”以“#0f0”。
	调用‘设像素’、‘图2’、‘x’、‘y’、‘色’、‘宽’。
上代码。
	如果那么先
赋予出以/tmp/test2.png。
赋予错以调用‘逐点修图’、/usr/share/icons/HighContrast/48x48/apps/gimp.png、‘出’、‘代码’。
处理了。
	如果那么先
赋予出以/tmp/test2a.png。
赋予错以调用‘逐点修图’、‘gzhl1.png’、‘出’、‘代码’。
处理了。

	如果那么先
赋予出以/tmp/test3.png。
赋予宽、高以2 90、140。
赋予x4s、y4s、ox4、oy4以205、0、5、10。
赋予x4e以算术‘x4s’+71。
赋予y4e以算术‘y4s’+115。
加载lib/gjke4。
赋予错以调用‘逐点拼图’、‘出’、‘宽’、‘高’、（#fff0）red、下代码
	（显示‘参数’换行。）
	别名“x”、“y”、“图2”、“图4”、“图42”以“参数1”、“参数2”、“参数3”、“参数4”、“参数5”。
	显示回车先算术“(‘宽’*‘y’+‘x’)/(‘宽’*‘高’)*100”、“2”了“% ‘y’,‘x’  ”、。
	圈子先
		赋予“x5”以算术“‘x’-‘ox4’”。
		赋予“y5”以算术“‘y’-‘oy4’”。
		赋予“x4”以算术“‘x5’+‘x4s’”。
		赋予“y4”以算术“‘y5’+‘y4s’”。
		如果‘x4’大于等于‘x4s’并且小于等于‘x4e’
		并且‘y4’大于等于‘y4s’并且小于等于‘y4e’
		那么先
			赋予“色”以调用‘得像素’、‘图4’、‘x4’、‘y4’。
			赋予“尾”以调用‘串截取’、‘色’、“13”。
			如果‘尾’等于“0000”否则遁出。
		了。
		赋予“色”以调用‘得像素’、‘图42’、先算术“‘x’+423”了、先算术“‘y’+289”了。
	了。
	如果‘色’那么
		调用‘设像素’、‘图2’、‘x’、‘y’、‘色’、‘宽’。
上代码、‘gzhl1.png’、‘49.jpg’。
处理了。

如果那么先
	赋予出以/tmp/bz4.png。
	赋予错以调用‘二图合一’、
		‘gzhl1.jpg’、
		‘gzhl1.jpg’、
		‘出’、#0000、1920、1080、-1、-1、12f。
处理了。
如果那么先
	赋予出以/tmp/bz2.png。
	赋予错以调用‘二图合一’、
		‘49.jpg’、
		‘49.jpg’、
		‘出’、#0000、1400、440、400、400、12f。
处理了。
如果那么先
	赋予出以/tmp/bz5.jpg。
	赋予错以调用‘二图合一+’、
		‘gzhl1.jpg’、
		‘gzhl1.jpg’、
		‘出’、#0000、1920、1080、-1、-1、123F、
		60、70、90、20、
		0、0、0、0。
处理了。
如果那么先
	赋予出以/tmp/bz5a.jpg。
	赋予错以调用‘二图合一+’、
		‘gzhl1.jpg’、
		‘gzhl1.jpg’、
		‘出’、#0000、-11、-11、-1、-1、123F、
		60、70、90、20、
		60、70、90、20。
处理了。

如果那么先
	赋予出以/tmp/bz6.jpg。
	赋予错以调用‘镜像图’、‘3.jpg’、‘出’、400、600、-1、-1、1、0、3、2。
处理了。
如果那么先
	赋予出以/tmp/bz6a.png。
	赋予错以调用‘镜像图’、‘49.png’、‘出’、0、0、1900、1000、1、0、3、2。
处理了。
如果那么先
	赋予出以/tmp/bz6b.png。
	赋予错以调用‘镜像图+’、‘gzhl1.jpg’、‘出’、0、0、1900、1000、0、1、2、3、60、64、81、17。
处理了。

如果那么先
	赋予1、2以/tmp/bz6b2、.jpg。
	赋予出以‘1’‘2’。
	赋予图、错以调用‘图/读取’、‘gzhl1.jpg’。
	如果‘图’那么先
		赋予图2、错以调用‘图/读取’、‘49.jpg’。

		显调图/剪裁、‘图’、60、64、81、17。
		显调图/保存、‘图’、‘1’b‘2’。
		显调图/限宽高、‘图’、500、500。
		显调图/保存、‘图’、‘1’c‘2’。

		显调图/限宽高、‘图2’、400、400。
		显调图/保存、‘图2’、‘1’a‘2’。

		赋予出图2、错以调用‘图/镜像’、‘图’、0、0、500、1000、0、1、2、3。
		赋予出图3、错以调用‘图/扩展’、‘图2’、#fff0、j、j、j、j、1200、900、/。

		赋予出图、错以调用‘图/二合一’、‘出图2’、‘出图3’、#0000、1920、1080、-1、-2、123F。

		赋予错以调用‘图/保存’、‘出图’、‘出’。
		调用‘图/释放’、‘图’。
		调用‘图/释放’、‘出图’。
		调用‘图/释放’、‘出图2’。
		调用‘图/释放’、‘出图3’。
		调用‘图/释放’、‘图2’。
	了。
处理了。
如果那么先
	赋予1、2以/tmp/bz6b3、.png。
	赋予出以‘1’‘2’。
	赋予图、错以显调“图/空白”、1700、1025、#fff0。
	赋予图3、错以显调“图/读取”、‘gzhl1.jpg’。
	赋予图2、错以显调“图/读取”、‘49.jpg’。

	显调“图/透通”、‘图3’。
	显调“图/透通”、‘图2’。
	显调“图/剪裁”、‘图3’、60、64、81、17。
	显调“图/缩放”、‘图3’、x500。
	显调“图/旋转”、‘图3’、110。
	显调“图/平翻”、‘图2’。

	显调“图/复合”、‘图’、‘图2’、0、0、0。
	显调“图/复合”、‘图’、‘图3’、200、100、3。
	显调“图/保存”、‘图’、‘出’。

	（赋予图4、错以显调“图/空白”、1700、1025、#fff。
	显调“图/复合”、‘图4’、‘图2’、0、0、0。
	显调“图/复合”、‘图4’、‘图3’、200、100、0。
	显调“图/保存”、‘图4’、‘1’.jpg。
	显调“图/释放”、‘图4’。）

	显调“图/释放”、‘图’。
	显调“图/释放”、‘图2’。
	显调“图/释放”、‘图3’。
处理了。
如果那么先
	赋予2、2-以下代码
		赋予图2【上】、错以显调“图/读取”、‘49.jpg’。
		显调“图/缩放”、‘图2’、x如果‘参数1’那么‘参数1’否则300。
	上代码、下代码
		显调“图/释放”、‘图2’。
	上代码。
	赋予出以/tmp/bz6b3.jpg。
	赋予图、错以显调“图/空白”、1000、1000、blue。

	解释‘2’。
	显调“图/复合”、‘图’、‘图2’、0、0、0。
	显调“图/平翻”、‘图2’。
	显调“图/复合”、‘图’、‘图2’、0、350、0。
	解释‘2-’。

	解释‘2’。
	显调“图/旋转”、‘图2’、180。
	显调“图/复合”、‘图’、‘图2’、0、700、0。
	解释‘2-’。

	解释‘2’。
	显调“图/直翻”、‘图2’。
	显调“图/复合”、‘图’、‘图2’、500、0、0。
	解释‘2-’。
	
	解释‘2’、200。
	显调“图/旋转”、‘图2’、90。
	显调“图/复合”、‘图’、‘图2’、500、350、0。
	解释‘2-’。
	
	解释‘2’、200。
	显调“图/旋转”、‘图2’、-90。
	显调“图/复合”、‘图’、‘图2’、750、350、0。
	解释‘2-’。

	显调“图/保存”、‘图’、‘出’。

	显调“图/释放”、‘图’。
处理了。

	如果那么先
赋予出以/tmp/b.png。
加载lib/doscmd4。
赋予错以调用‘藏字于图’、先调用‘type’、“/_htm/红砂手.txt”了、‘49.jpg’、‘出’。
赋予错、文以调用‘取字于图’、‘出’。
如果不‘错’那么显示‘文’换行。
处理了。

如果那么先
	赋予出以/tmp/bz7.jpg。
	赋予图、错以显调“图/空白”、1400、700、blue。
	赋予图2、错以显调“图/读取”、‘49.jpg’。
	显调“图/得宽高”、‘图2’。

	显调-“图/复合”、‘图’、‘图2’、0、0、0。
	显调-“图/互拉丝”、‘图’、303、110、230、366、0、0、-。
	显调-“图/互拉丝”、‘图’、1130、20、200、300、0、0、|。
	显调-“图/互拉丝”、‘图’、700、145、200、110、0.6（1）、0、|。
	显调-“图/互拉丝”、‘图’、760、510、230、170、-0.2、0、-。

	显调“图/保存”、‘图’、‘出’。

	显调“图/释放”、‘图’。
	显调“图/释放”、‘图2’。
处理了。
如果那么先
	赋予出以/tmp/bz7a.jpg。
	赋予w、h以1600、970。
	赋予图、错以显调“图/空白”、‘w’、‘h’、。
	循环【3】【次】赋予图‘次’、错以显调“图/读取”、‘49.jpg’。

	赋予w1、x1、y1以600、20、20。
	循环【3】【次】显调-“图/缩放”、‘图‘次’’、‘w1’。
	显调-“图/复合”、‘图’、‘图3’、777、555、0。
	显调-“图/复合”、‘图’、‘图2’、‘x1’、‘y1’、0。
	赋予x2以算术‘w’-(‘x1’+‘w1’)。
	赋予y2以100。
	显调-“图/复合”、‘图’、‘图1’、‘x2’、‘y2’、0。
	赋予x3以算术‘x1’+‘w1’-1。
	赋予y3以算术‘y1’*3。
	赋予w3以算术‘w’-‘x3’-‘w1’-‘x1’+4。
	赋予h3以算术300。
	显调-“图/互拉丝”、‘图’、‘x3’、‘y3’、‘w3’、‘h3’、-0.1、1、-。
	显调-“图/互拉丝”、‘图’、1000、499、200、56、-0.3、1、|。

	显调“图/保存”、‘图’、‘出’。

	显调“图/释放”、‘图’。
	循环【3】【次】显调“图/释放”、‘图‘次’’。
处理了。
如果那么先
	赋予出以/tmp/bz7b.jpg。
	赋予w、h以1600、970。
	赋予图、错以显调“图/空白”、‘w’、‘h’、。
	循环【2】【次】赋予图‘次’、错以显调“图/读取”、‘49.jpg’。
	显调-“图/剪裁”  、‘图1’、0、0、500、500。
	显调-“图/剪裁二”、‘图2’、0、0、500、500。
	赋予图22、错以显调“图/复制”、‘图2’。
	显调-“图/背景色”、‘图2’、yellow。
	显调-“图/旋转”、‘图2’、12。
	显调-“图/复合”、‘图’、‘图1’、1、1、0。
	显调-“图/复合”、‘图’、‘图2’、700、300、0。

	显调-“图/平翻”、‘图22’。
	显调-“图/背景色”、‘图22’、#f00。
	显调-“图/旋转”、‘图22’、-4.79。
	显调-“图/复合”、‘图’、‘图22’、1000、300、0。

	显调“图/保存”、‘图’、‘出’。
	显调“图/释放”、‘图’。
	循环【2】【次】显调“图/释放”、‘图‘次’’。
	显调“图/释放”、‘图22’。
处理了。
如果那么先
	赋予出以/tmp/bz7c.jpg。
	赋予w、h以1604、1071。
	赋予图、错以显调“图/空白”、‘w’、‘h’、。
	赋予图1、错以显调“图/读取”、‘49.jpg’。
	显调-“图/复合”、‘图’、‘图1’、0、0、0。

	赋予i、y2、w2、h2以100、240。
	赋予x2以算术‘w’-‘w2’。
	赋予x3、、y3以先算术‘x2’-‘i’了、算术‘y2’+‘i’。
	显调-“图/斜分”、‘图’、‘x3’、‘y2’、-‘w2’、-‘h2’。
	显调-“图/斜分”、‘图’、‘x2’、‘y2’、‘w2’、-‘h2’。
	显调-“图/斜分”、‘图’、‘x2’、‘y3’、‘w2’、先算术‘h2’*2了。
	显调-“图/斜分”、‘图’、‘x3’、‘y3’、-先算术‘w2’*2了、‘h2’。

	显调“图/保存”、‘图’、‘出’。
	显调“图/释放”、‘图’。
	显调“图/释放”、‘图1’。
处理了。
如果1那么先
	赋予出以/tmp/bz7d.jpg。
	赋予图、错以显调“图/空白”、1604、1071、。
	赋予图1、错以显调“图/读取”、‘49.jpg’。
	显调-“图/复合”、‘图’、‘图1’、2、-440、0。

	显调“图/保存”、‘图’、‘出’。
	显调“图/释放”、‘图’。
	显调“图/释放”、‘图1’。
处理了。
