加载lib/defi。
显示‘参数0’:‘参数-1’:‘参数’换行。
隧道错误提示到控制台。

隧道插件信息为下代码
	显示‘参数’↙。
上代码。

隧道侦听为点击为fullscreen、unfullscreen、alwaysontop、unalwaysontop为下代码隧道‘参数1’上代码。

隧道侦听为点击为notify为下代码
加载lib/notify4。
如果通知域应用test那么先
	赋予1以先隧道屏幕宽了*先隧道屏幕高了换行
		先隧道窗口宽了*先隧道窗口高了,先隧道边框宽了换行
		先隧道宽为vbox1了*先隧道高为vbox1了换行
		先隧道宽为toolbar1了*先隧道高为toolbar1了换行
		先隧道宽为notebook1了*先隧道高为notebook1了换行
		换行。
	赋予通知以通知域新增：‘1’‘肇事者’换行‘动作’换行‘参数-1’换行‘参数’、、
		/usr/share/icons/gnome/scalable/places/ubuntu-logo.svg、隧道窗口。
	如果‘通知’那么先
		通知域时间‘通知’、10000。
		通知域显示‘通知’。
	了。
了。
上代码。

隧道侦听为点击为open、save、selectdir、dir为下代码
	赋予文件以隧道文件选择、‘参数1’、‘参数1’。
	如果‘文件’那么隧道提示、‘文件’、‘参数1’。
上代码。

赋予【顶】图标夹以隧道图标夹为iconview1、菜单为menu1、外菜单为menu2。
隧道“图标夹”、“增加”、一、1、/usr/share/icons/hicolor/scalable/apps/gnome-panel-launcher.svg、、‘图标夹’。
隧道“图标夹”、“增加”、二、2、/usr/share/icons/hicolor/scalable/apps/gnome-panel-launcher.svg、、‘图标夹’。

隧道侦听为点击为iv_get、iv_get2为下代码
	隧道“图标夹”、“获取”、下代码
		（加载lib/vartable4。解释‘变量表方法’。）
		隧道提示为‘参数1’换行‘参数2’换行‘参数3’换行‘参数4’换行‘参数5’、‘【上】参数1’。
	上代码、‘图标夹’。
上代码。

隧道侦听为点击为iv_clear、iv_clear2为下代码
	隧道图标夹、清空、‘图标夹’。
上代码。

隧道侦听为点击为iv_add为下代码
	隧道“图标夹”、“增加”、三、3、/usr/share/icons/hicolor/scalable/apps/gnome-panel-launcher.svg、、‘图标夹’。
上代码。

隧道侦听为点击为iv_del为下代码
	隧道“图标夹”、“移除”、‘图标夹’。
上代码。

隧道侦听为点击为iv_set4为下代码
	隧道“图标夹”、“更新”、四、4、/usr/share/icons/hicolor/scalable/apps/gnome-panel-fish.svg、、‘图标夹’。
上代码。

隧道侦听为点击为iv_select为下代码
	隧道“图标夹”、“选择”、4、多选、‘图标夹’。
上代码。

赋予表格以隧道建立表格为1、10为scrolledwindow2。
隧道查看模板为frame1。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、1为‘模板’为‘表格’。隧道设置模板单元为8为<b>一</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、2为‘模板’为‘表格’。隧道设置模板单元为8为<b>二</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、3为‘模板’为‘表格’。隧道设置模板单元为8为<b>三</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、4为‘模板’为‘表格’。隧道设置模板单元为8为<b>四</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、5为‘模板’为‘表格’。隧道设置模板单元为8为<b>五</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、6为‘模板’为‘表格’。隧道设置模板单元为8为<b>六</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、7为‘模板’为‘表格’。隧道设置模板单元为8为<b>七</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、8为‘模板’为‘表格’。隧道设置模板单元为8为<b>八</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、9为‘模板’为‘表格’。隧道设置模板单元为8为<b>九</b>为‘模板’。
赋予模板以隧道复制模板为frame1。隧道设置表格单元为1、10为‘模板’为‘表格’。隧道设置模板单元为8为<b>十</b>为‘模板’。

加载lib/gjk4。
定义【顶】【无参】π以3.14159。

隧道侦听为点击为installchonghui为下代码
	如果不存在画架那么
		赋予【顶】画架以隧道绘图、画架为drawingarea1。
	隧道绘图、代码、下代码
		更新状态栏‘参数栈’。
		解释下代码	基于“隧道绘图、‘参数栈’、‘画架’。”先	上代码
			先隧道内容为textview1了
		下代码	了。	上代码。
	上代码、‘画架’。
	隧道绘图、刷新为‘画架’。
上代码。

隧道侦听为点击为clearchonghui为下代码
	如果存在画架那么先
		基于“隧道绘图、‘参数栈’、‘画架’”先
			代码、。
			刷新。
		了。
	了。
上代码。

隧道侦听为点击为shuaxin为下代码
	如果不存在画架那么
		赋予【顶】画架以隧道绘图、画架为drawingarea1。
	（隧道绘图、刷新为‘画架’。）
	解释下代码
		基于“隧道绘图、‘参数栈’、‘画架’。”先
	上代码
		先隧道内容为textview2了
	下代码
		了。
	上代码。
上代码。

定义【顶】更新状态栏以“
	显示‘肇事者’-‘动作’-‘参数数目’[‘参数’]↙。
	（隧道提示、‘肇事者’换行‘动作’换行‘参数-1’[‘参数’]。）
	隧道标题为“‘肇事者’‘动作’ ‘参数数目’[‘参数’]”。
	隧道定时器、清除状态栏、5000、下代码
		隧道定时器、‘动作’、移除。
		隧道标题为。
	上代码。
”。

隧道最小化到托盘为驻留。

隧道定时器、一个、1000、下代码
	隧道定时器、一个、移除。
	更新状态栏‘参数栈’。
上代码。

